import { downwardArrow, whiteArrow } from "../../svgs";

function FirstSection() {
  return (
    <section
      className="flex flex-col items-end text-right sm:w-[16vw]"
      aria-label="יצירת קשר"
    >
      <h2 className="text-xl font-[700]">!אנחנו פה בשבילך ונשמח לעזור</h2>
      <button
        type="button"
        aria-label="צרו איתנו קשר"
        className="bg-[#0AB285] rounded-sm p-2 my-4 flex"
      >
        <span className="p-2">{whiteArrow}</span>
        <p className="px-2 font-bold">צרו איתנו קשר</p>
      </button>
      <ul className=" flex flex-col space-y-4 font-[400] ">
        <li>כתובת: דרך מנחם בגין 74,ת.ד 51231 תל-אביב 6721516</li>
        <li>טלפון: 03-6270200</li>
        <li>פקס: 03-6270206</li>
        <li>kanat@kanat.co.il :דוא״ל</li>
      </ul>
    </section>
  );
}

function SecendSection() {
  return (
    <section
      className="text-white flex flex-col text-right sm:w-[28vw]"
      aria-label="מידע כללי"
    >
      <div>
        <div className="flex sm:justify-end justify-between pt-8 sm:pt-0">
          <span className="sm:hidden flex justify-center items-center">
            {downwardArrow}
          </span>
          <h2 className="text-xl font-[700] my-4 sm:my-0 sm:mb-6  ">
            מידע כללי
          </h2>
        </div>

        <div className="h-px w-full bg-white/20 my-2 sm:hidden" />
      </div>
      <div className=" sm:flex sm:justify-between font-[400]  hidden ">
        <ul className="space-y-4 ">
          <li>מאגר ספקים</li>
          <li>שירות לקוחות</li>
          <li>מדריך שאלות ותשובות</li>
          <li>פרסום הסדרי נגישות</li>
          <li>מכרזים</li>
          <li>דרושים</li>
        </ul>
        <ul className="space-y-4">
          <li>ארכיון חוזי ביטוח</li>
          <li>פניות הציבור</li>
          <li>הצהרת חופש מידע</li>
          <li>אמנת שירות</li>
        </ul>
      </div>
    </section>
  );
}

function ImgSection() {
  return (
    <div className="flex justify-end">
      <img
        src={"/images/footer/kanat.png"}
        alt="לוגו קנט"
        role="img"
        className="w-[135px] h-[104px] sm:w-[148.8px] sm:h-[115px]"
      ></img>
    </div>
  );
}

function SvgSection() {
  return (
    <div className="flex justify-center items-center my-14">
      <svg
        width="266"
        height="23"
        viewBox="0 0 266 23"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        aria-hidden="true"
        focusable="false"
      >
        <path
          d="M265.934 3.72929L262.464 19.8531C262.201 20.9909 261.519 21.2741 260.549 20.7384L255.26 16.8994L252.708 19.3174C252.425 19.5958 252.19 19.828 251.645 19.828L252.025 14.5227L261.827 5.79848C262.253 5.42461 261.734 5.21664 261.165 5.59131L249.047 13.1074L243.831 11.4987C242.696 11.1499 242.676 10.3811 244.067 9.84461L264.471 2.10112C265.416 1.75235 266.243 2.30828 265.934 3.73009V3.72929Z"
          fill="white"
        />
        <path
          d="M200.994 21V6.83134H196.278V21H200.994ZM198.637 4.89568C200.281 4.89568 201.305 3.8077 201.305 2.44807C201.274 1.05779 200.281 0 198.668 0C197.055 0 196 1.05781 196 2.44807C196 3.80776 197.023 4.89568 198.606 4.89568H198.637H198.637ZM203.604 21H208.32V13.0875C208.32 12.6641 208.351 12.241 208.476 11.9383C208.816 11.0923 209.592 10.216 210.895 10.216C212.602 10.216 213.284 11.5153 213.284 13.42V20.9999H218V12.8757C218 8.52366 215.673 6.4987 212.571 6.4987C210.027 6.4987 208.91 7.91876 208.289 8.88595H208.32V6.83104H203.605C203.666 8.16055 203.605 20.9997 203.605 20.9997L203.604 21Z"
          fill="white"
        />
        <path
          d="M2.80805 22.7857V12.094H0V8.24446H2.80805V4.95646C2.80805 2.37272 4.46677 0 8.28882 0C9.83631 0 10.9806 0.14936 10.9806 0.14936L10.8904 3.74417C10.8904 3.74417 9.72344 3.73273 8.44996 3.73273C7.07167 3.73273 6.85085 4.37221 6.85085 5.4336V8.24446H11L10.8195 12.094H6.85085V22.7857H2.80805Z"
          fill="white"
        />
        <path
          d="M64 5.13818C63.1542 5.48965 62.2337 5.74261 61.2857 5.84113C62.27 5.2778 63.0071 4.38782 63.3587 3.33818C62.4351 3.8675 61.4232 4.23866 60.368 4.43522C59.927 3.98103 59.3936 3.6192 58.801 3.37228C58.2085 3.12536 57.5695 2.99864 56.9239 3.00001C54.3119 3.00001 52.2112 5.03965 52.2112 7.54261C52.2112 7.89409 52.2554 8.24557 52.3272 8.58374C48.4161 8.38669 44.9278 6.58669 42.6087 3.83078C42.1861 4.52606 41.9647 5.31771 41.9674 6.12338C41.9674 7.69971 42.7994 9.08965 44.0681 9.90711C43.3205 9.87874 42.5903 9.68077 41.937 9.3293V9.38521C41.937 11.5926 43.5568 13.4219 45.7155 13.8426C45.3102 13.944 44.8932 13.9959 44.4745 13.997C44.1676 13.997 43.8774 13.9678 43.5844 13.9278C44.1815 15.7278 45.9201 17.0352 47.9904 17.0778C46.3706 18.3 44.3418 19.0189 42.1388 19.0189C41.7435 19.0189 41.3787 19.0056 41 18.963C43.0897 20.2544 45.569 21 48.2392 21C56.9073 21 61.6505 14.0823 61.6505 8.07782C61.6505 7.88078 61.6505 7.68374 61.6367 7.48669C62.5544 6.83965 63.3587 6.03817 64 5.13818Z"
          fill="white"
        />
        <path
          d="M103.497 8.33198C101.753 8.33198 100.329 9.75557 100.329 11.5C100.329 13.2444 101.753 14.668 103.497 14.668C105.242 14.668 106.665 13.2444 106.665 11.5C106.665 9.75557 105.242 8.33198 103.497 8.33198ZM112.999 11.5C112.999 10.1881 113.011 8.88811 112.937 7.5786C112.863 6.05757 112.516 4.70766 111.404 3.59541C110.29 2.48078 108.942 2.13617 107.421 2.0625C106.109 1.98882 104.809 2.00071 103.5 2.00071C102.188 2.00071 100.888 1.98882 99.5785 2.0625C98.0575 2.13617 96.7076 2.48316 95.5954 3.59541C94.4808 4.71004 94.1362 6.05757 94.0625 7.5786C93.9888 8.89049 94.0007 10.1905 94.0007 11.5C94.0007 12.8095 93.9888 14.1119 94.0625 15.4214C94.1362 16.9424 94.4831 18.2923 95.5954 19.4046C96.71 20.5192 98.0575 20.8638 99.5785 20.9375C100.89 21.0112 102.19 20.9993 103.5 20.9993C104.812 20.9993 106.112 21.0112 107.421 20.9375C108.942 20.8638 110.292 20.5168 111.404 19.4046C112.519 18.29 112.863 16.9424 112.937 15.4214C113.013 14.1119 112.999 12.8119 112.999 11.5ZM103.497 16.3744C100.8 16.3744 98.6231 14.1974 98.6231 11.5C98.6231 8.80255 100.8 6.62558 103.497 6.62558C106.195 6.62558 108.372 8.80255 108.372 11.5C108.372 14.1974 106.195 16.3744 103.497 16.3744ZM108.571 7.56434C107.942 7.56434 107.433 7.05575 107.433 6.42595C107.433 5.79615 107.942 5.28755 108.571 5.28755C109.201 5.28755 109.71 5.79615 109.71 6.42595C109.71 6.5755 109.681 6.72361 109.624 6.86181C109.566 7.00001 109.483 7.12558 109.377 7.23133C109.271 7.33708 109.145 7.42093 109.007 7.47807C108.869 7.53521 108.721 7.56453 108.571 7.56434Z"
          fill="white"
        />
        <path
          d="M165.515 5.65408C165.384 5.14065 165.128 4.67252 164.772 4.29654C164.415 3.92057 163.972 3.64994 163.486 3.51173C161.695 3 154.5 3 154.5 3C154.5 3 147.305 3 145.514 3.51173C145.028 3.64994 144.585 3.92057 144.228 4.29654C143.872 4.67252 143.616 5.14065 143.485 5.65408C143.151 7.58243 142.989 9.53964 143.001 11.5C142.989 13.4604 143.151 15.4176 143.485 17.3459C143.616 17.8594 143.872 18.3275 144.228 18.7035C144.585 19.0794 145.028 19.3501 145.514 19.4883C147.305 20 154.5 20 154.5 20C154.5 20 161.695 20 163.486 19.4883C163.972 19.3501 164.415 19.0794 164.772 18.7035C165.128 18.3275 165.384 17.8594 165.515 17.3459C165.849 15.4176 166.011 13.4604 165.999 11.5C166.011 9.53964 165.849 7.58243 165.515 5.65408ZM152.2 15.1429V7.85714L158.172 11.5L152.2 15.1429Z"
          fill="white"
        />
      </svg>
    </div>
  );
}

function FooterSection() {
  const lineSvg = (
    <span className="flex justify-center items-center p-1.5">
      <svg
        width="1"
        height="13"
        viewBox="0 0 1 13"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <line
          opacity="0.8"
          x1="0.5"
          y1="2.18557e-08"
          x2="0.499999"
          y2="13"
          stroke="white"
        />
      </svg>
    </span>
  );
  return (
    <footer
      role="contentinfo"
      className="bg-[#3D256D] flex flex-col sm:justify-between sm:flex-row sm:px-[12vw] py-8 w-screen"
    >
      <div className="flex flex-wrap space-x-2 justify-center mb-6 sm:mb-0 ">
        <p className="sm:order-5">מפת אתר</p>
        <span className="sm:order-2">{lineSvg}</span>
        <p className="sm:order-7">©כל הזכויות שמורות לקנט 2021</p>
        <p className="sm:order-1">הצהרת נגישות</p>
        <span className="sm:order-4">{lineSvg}</span>
        <p className="sm:order-3">תנאי שימוש ופרטיות</p>
        <span className="hidden sm:flex sm:order-6 px-2">{lineSvg}</span>
      </div>
      <span className="flex justify-center items-center sm:order-first text-[22px]">
        <p>dooble</p>
      </span>
    </footer>
  );
}

function FooterComp() {
  return (
    <div className="bg-[#452A7A] text-white" role="contentinfo">
      <div className="sm:hidden">
        <div className="p-8">
          <ImgSection />
          <div className="h-px w-full bg-white/20 my-6 sm:hidden" />

          <FirstSection />
          <SecendSection />
          <SvgSection />
        </div>
        <FooterSection />
      </div>
      <div className="hidden sm:flex">
        <div>
          <div className="px-[12vw] py-12 flex justify-between">
            <div className="flex flex-col justify-start items-start space-y-16">
              <ImgSection />
              <SvgSection />
            </div>
            <SecendSection />
            <FirstSection />
          </div>
          <FooterSection />
        </div>
      </div>
    </div>
  );
}

export default FooterComp;
